travel/arabic-phrasebook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-11 Wed 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gulf Arabic phrasebook</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gulf Arabic phrasebook</h1>


<div id="outline-container-orgba2f545" class="outline-2">
<h2 id="orgba2f545"><span class="section-number-2">1.</span> Greetings In Gulf Arabic</h2>
<div class="outline-text-2" id="text-1">
<p>
#1 – Hello (Peace be upon you) – As-salaamu ‘alaykum – السلام عليكم
</p>

<p>
#2 – Hello (and also with you) (response) – Wa ‘alaykum as-salaam –  و عليكم السلام 
</p>

<p>
#3 – Hello – MarHaba – مرحبا
</p>

<p>
#4 – Hello (response to “hello”) – MarHabtein – مرحبتين
</p>

<p>
#5 – Hello/Welcome! – Ahlan wa Sahlan – أهلا و سهلا 
</p>

<p>
#6 – Hi! – Ya hala – يا هلا
</p>

<p>
#7 – Hi! – Hala – هلا
</p>

<p>
#8 – Hello! – Ahlan beek/beech – اهلا بيك
</p>

<p>
#9 – Greetings/God bless you (may God give you life) – Hayyak Allah- حياك الله
</p>

<p>
#10 – Greetings (may God bless you) (response) – Allah yaHayyeek – الله يحييك 
</p>

<p>
#11 – Hello? (on the phone) – Alo? – الو
</p>

<p>
There’s also different greetings that you can use depending on the time of the day. And if you know any of the other Arabic dialects or have studied MSA, you’ll likely have learned these already: 
</p>

<p>
#12 – Good morning – SabaH alkhayr – صباح الخير
</p>

<p>
#13 – Good morning (response) – SabaH al-noor – صباح النور
</p>

<p>
#14 – Good evening – Masa’ alkhayr – مساء الخير 
</p>

<p>
#15 – Good evening (response) – Masa’ al-noor – مساء النور
</p>

<p>
Make sure to keep your eyes and ears open to learn the responses to different greetings, which are not always the same.
</p>

<p>
One time when I was first learning Arabic, I greeted someone first by saying “Sabah al-noor / صباح النور” (good morning (response)), which got some funny looks. 
</p>
</div>
</div>

<div id="outline-container-orgae1480b" class="outline-2">
<h2 id="orgae1480b"><span class="section-number-2">2.</span> Meeting People In Gulf Arabic</h2>
<div class="outline-text-2" id="text-2">
<p>
People in the Gulf are very hospitable and welcoming, so from experience, I can say that in addition to a lot of eating, tea-drinking, and shopping, there’s a good chance that you’ll be doing a lot of small talk while meeting people. 
</p>

<p>
Whether you’re walking around town or shopping in the souk (market), having these Gulf Arabic phrases up your sleeve will set you apart from other visitors, and will help you start to get to know your peers in the Gulf region.
</p>

<p>
#16 – How are you? (in Kuwait and Qatar) – Shlonek?(masculine)/Ishlonik?(feminine)  – شلونك؟
</p>

<p>
It’s good to note here that there are different conjugations for this phrase, as well as other phrases, depending on the gender or the number of people you are addressing. For example, if you want to ask a large group of people how they are doing, you’d say: 
</p>

<p>
#17 – How are you? – shlonkum? – شلونكم؟ 
</p>

<p>
There are also other phrases you can use to ask how people are doing, like: 
</p>

<p>
#18 – How are you? (in UAE) – IshHalek?/IshHalik? – اشحالك؟
</p>

<p>
#19 – How are you? – Keyf Halek?/Keyf Halik? – كيف حالك؟ 
</p>

<p>
#20 – How are you? (in Saudi Arabia) – Wishlonak?/Wishlonek? – وشلونك؟
</p>

<p>
#21 – How are you? (What’s new?) – Shoo khbarak?/Shoo khbarek? – شو خبارك؟ 
</p>

<p>
#22 – Are things going well? – Umoor tayyiba? – أمور طيبة؟
</p>

<p>
As you can see, there are variations on the question “how are you?” depending on which country in the Gulf you are in.
</p>

<p>
To be safe, it’s worth learning all of them so that you can recognize them as you hear them, and to get a basic idea of which ones to use in different Gulf countries. 
</p>

<p>
To respond to someone asking how you’re doing, you can use any one of these phrases: 
</p>

<p>
#23 – Thanks be to God (all is well) – Alhamdulillah – الحمد الله
</p>

<p>
#24 – Fine, thanks be to God – Bikhayr, alhamdulillah – بخير الحمد لله
</p>

<p>
#25 – Fine, thanks be to God – Zayn, alhamdulillah – زين الحمد لله
</p>

<p>
The last of these three (Zayn, alhamdulillah / زين الحمد لله) is the most ‘Gulf’-sounding of the three. I definitely get more positive reactions when I used this response compared to the others. 
</p>
</div>
</div>

<div id="outline-container-orge550903" class="outline-2">
<h2 id="orge550903"><span class="section-number-2">3.</span> Being Polite In Gulf Arabic</h2>
<div class="outline-text-2" id="text-3">
<p>
Politeness is highly valued and regarded in any Arabic-speaking country, so it’ll always go a long way to know a few Gulf Arabic phrases that allow you to be polite and show respect towards the people around you. 
</p>

<p>
Of all of the phrases to help you get around, you should definitely learn: 
</p>

<p>
#26 – Thank you – Shookran – شكرا
</p>

<p>
This is the simplest way to say “thank you”, but there are also other ways that you can express thanks or gratitude. Here’s a list of them, as well as the most standard responses to “thank you”: 
</p>

<p>
#27 – Thanks – Mashkoor/a – مشكور/ة 
</p>

<p>
#28 – Thanks (plural) – Mashkooreen – مشكورين
</p>

<p>
#29 – Thanks to you – Shukran lak/lek – شكرا لك
</p>

<p>
#30 – Thanks (Health to you) – Tislam/Tislami – تسلم/ي
</p>

<p>
#31 – Thanks (Health to your hands) – Tislam/i Eedak/ek – تسلم/ي ايدك
</p>

<p>
#32 – Thank you (May God bless you) – Ya’aTeek al’Aafi – يعطيك العافي
</p>

<p>
#33 – Thank you very much – Shukran jazeelan – شكرا جزيلا
</p>

<p>
#34 – You’re welcome – ‘afwan – عفوا 
</p>

<p>
#35 – You’re welcome (Forgiveness) – Ela’afoo – العفو
</p>


<p>
If you’re trying to sound the most local, then I’d definitely recommend that you say “Mashkoor/a / مشكور/ة”. The last time I was in a souq / سوق (market) in Kuwait, using this phrase helped me get a better bargain. 
</p>

<p>
There are also other phrases that you can use to be respectful towards the people around you. For example: 
</p>

<p>
#36 – Excuse me – Low samaht/samahti – لو سمحت/ي
</p>

<p>
#37 – Excuse me – IsmaH lee – اسمح لي
</p>

<p>
#38 – Please – Min FaDlak/FaDlech – من فضلك 
</p>

<p>
#39 – I’m sorry – Aasif/aasifa – اسف
</p>

<p>
#40 – Please (come in/go ahead) – TafaDal/i – تفضل/ي
</p>
</div>
</div>

<div id="outline-container-org7ee82f9" class="outline-2">
<h2 id="org7ee82f9"><span class="section-number-2">4.</span> Useful Everyday Gulf Arabic Phrases</h2>
<div class="outline-text-2" id="text-4">
<p>
If you’re walking around in a country or city that uses Gulf Arabic, there are a number of sentences that are worth memorizing so that you can go about your everyday life. Here are some phrases to help you get through if you’re the only English speaker around: 
</p>

<p>
#41 – How do I go to <span class="underline">_</span>? – Shloon arooH <span class="underline">__</span>? – شلون أروح _____؟ 
</p>

<p>
#42 – Do you speak English? – Tatakallam inglizi? – تتكلم/ي انغليزي؟
</p>

<p>
#43 – I want <span class="underline">_</span>. – Abee <span class="underline">__</span>. – أبي <span class="underline">__</span>. 
</p>

<p>
#44 – I don’t want <span class="underline"><span class="underline">__</span></span>. – Ma abee <span class="underline">__</span>. – ما أبي <span class="underline">__</span>. 
</p>

<p>
#45 – I don’t understand Arabic. – Ma afham ‘arabi. – ما أفهم عربي
</p>

<p>
#46 – I know a little bit of Arabic. – A’aref ‘arabi shway. – أعرف عربة شوي
</p>

<p>
#47 – Can you say that again? – Mumkin ta’id marra thaniya? – ممكن تعد مرّة ثانية؟ 
</p>

<p>
#48 – I’m ready to order. – Ana jahiz/a aTlab. – أنا جاهز/ة أطلب.
</p>

<p>
#49 – Can I have the bill please? – El-Hisab low samaHt. – الحساب لو سمحت 
</p>

<p>
#50 – Where is____? – Wayn____? –  وين ____؟ 
</p>

<p>
#51 – How much does this cost? – Kam thaman hada? – كم ثمن هادا؟ 
</p>

<p>
#52 – What’s the time? – Al-sa’aa kam? – الساعة كم؟ 
</p>

<p>
While you might want to automatically say that you don’t speak or understand Arabic – in my experience, this has always turned off the potential for more conversation. Instead, you can say that you know a little bit. That way, the locals can keep trying to practice speaking with you and you can improve your language skills. 
</p>

<p>
There’s also plenty of one-word phrases that will help you communicate with the people around you. Here’s a short list to get you started: 
</p>

<p>
#53 – Yes – Eeh – اي
</p>

<p>
#54 – No – La – لا
</p>

<p>
#55 – Yes, of course – Eeh, bala – اي بلى
</p>

<p>
#56 – Sure – Akeed – أكيد
</p>

<p>
#57 – Of course – Taba’an – طبعا  
</p>

<p>
#58 – Exactly/precisely – BaDhabt – بضبط
</p>

<p>
#59 – God willing (hopefully) – Inshallah – ان شاء الله 
</p>

<p>
#60 – Let’s go – Yallah – يالا
</p>
</div>
</div>

<div id="outline-container-org3c5a207" class="outline-2">
<h2 id="org3c5a207"><span class="section-number-2">5.</span> Introductions And Getting To Know Each Other In Gulf Arabic</h2>
<div class="outline-text-2" id="text-5">
<p>
To get to know a culture, you have to get to know the people who live in it! Here are some handy Gulf Arabic phrases that you can use to introduce yourself and to get to know the people around you. 
</p>

<p>
#61 – What’s your name? – Eesh ismak/ismek? –  ايش اسمك؟
</p>

<p>
#62 – My name is <span class="underline">_</span> – Ismi <span class="underline">_</span> – اسمي___
</p>

<p>
#63 – Where are you from? – Min weyn ent/enti? – من وين انت/ي؟
</p>

<p>
#64 – I’m from <span class="underline">_</span>. – Ana min <span class="underline">_</span>. – أنا من __.
</p>

<p>
#65 – Where do you work? – Wayn tashtaghli? – وين تشتغل/ي؟
</p>

<p>
#66 – I work at <span class="underline">__</span>. – أشتغل في <span class="underline"><span class="underline">_</span></span>. 
</p>

<p>
#67 – Where do you live? – Wayn sakin/e? – وين ساكن/ة؟ 
</p>

<p>
#68 – I live in <span class="underline"><span class="underline">_</span></span> – Sakin/Sakna fi  <span class="underline">__</span>. – ساكن/ة في___. 
</p>

<p>
#69 – Nice to meet you – Tasharrafna – تشرفنا 
</p>

<p>
#70 – Nice to meet you too (the honor is mine) – Sharaf lana – شرف النا
</p>
</div>
</div>

<div id="outline-container-orgd0c3997" class="outline-2">
<h2 id="orgd0c3997"><span class="section-number-2">6.</span> Gulf Arabic Phrases To Say Goodbye</h2>
<div class="outline-text-2" id="text-6">
<p>
If you’re ready to head home and get some rest after going around town and meeting some people, you’ll need to know how to say “goodbye”. 
</p>

<p>
The best way to do this is to say: 
</p>

<p>
#71 – Goodbye – Ma’asalaameh – مع السلامة
</p>

<p>
#72 – Bye – Yalla bay – يلا باي
</p>

<p>
#73 – God be with you – Allah Ma’ak – الله معك 
</p>

<p>
#74 – See you (Hope to see you when it’s good) – Nshoofak ‘ala khayr – نشوفك على خير
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-12-11 Wed 19:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
